{
  "recipes": [{
      "recipeCreated": "24.4.2019. 12:22:44",
      "recipeChecked": "24.4.2019. 18:46:44",
      "recipeNumber": 117,
      "views": 0,
      "authorId": 1,
      "category": "Glavna jela",
      "kitchen": "Srpska",
      "preparation": "Lako",
      "personNumber": "4 osobe",
      "timePrep": 45,
      "title": "Piletina sa šampinjonima",
      "recipeInfo": "",
      "imgUrl": "./img/piletina_sa_sampinjonima.jpg",
      "qty_1": "500 g",
      "ingredient_1": "belo meso",
      "qty_2": "500 g",
      "ingredient_2": "šampinjoni",
      "step_1": "Iseckati crni luk zajedno sa belim lukom i šargarepom (na kockice). Propržiti.",
      "step_2": "U drugoj posudi pripremiti belo meso. Odvojiti ga od kostiju i iseći na manje šnicle.",
      "advice": "Umesto belog mesa može da se koristi i bilo koje drugo meso postupak je isti. Meso na ovaj način pripremljeno je veoma mekano i sočno.",
      "posno": false,
      "vegetarijanski": false,
      "ingredients": 10,
      "steps": 8,
      "id": 1,
      "qty_3": "1 glavica",
      "ingredient_3": "crni luk",
      "qty_4": "2 čena",
      "ingredient_4": "beli luk",
      "qty_5": "1 kom",
      "ingredient_5": "šargarepa",
      "qty_6": "1 kašika",
      "ingredient_6": "začin",
      "qty_7": "po želji",
      "ingredient_7": "biber u prahu",
      "qty_8": "2 kašike",
      "ingredient_8": "kisela pavlaka",
      "qty_9": "1 kašika",
      "ingredient_9": "gustin",
      "qty_10": "200 g",
      "ingredient_10": "pirinač",
      "qty_11": "",
      "ingredient_11": "",
      "step_3": "Svaku šniclu valjati u brašno pa poređati po izdinstanom luku.",
      "step_4": "Poredjati meso jedno pored drugog, a ako ima još mesa poredjati i odozgo.",
      "step_5": "Naliti meso sa čašom vode 2 dl i dinstati na tihoj vatri 30 minuta. Povremeno šerpu protresti.",
      "step_6": "10 minuta pred kraj dodati očišćene šampinjone isečene samo na pola.",
      "step_7": "Posle desetak minuta dodati prvo razmućen gustin u malo vode, a odmah zatim i dve kašike pavlake. Prokrčkati jedan minut i skloniti sa vatre i začiniti.",
      "step_8": "Skuvati i pirinač kao prilog i aranžirati (može i pire krompir)."
    },
    {
      "recipeCreated": "25.4.2019. 10:36:00",
      "recipeChecked": "26.4.2019. 08:36:00",
      "recipeNumber": 812,
      "views": 0,
      "authorId": 1,
      "category": "Hladna predjela",
      "kitchen": "Srpska",
      "preparation": "Srednje",
      "personNumber": "4 osobe",
      "timePrep": 45,
      "title": "Zlatni slani rolat",
      "recipeInfo": "Rolat punjen šunkom i feta sirom..mmmm...\n\nOvaj recept je, bez sumnje, najukusniji slani rolat koji sam ikada napravila. Kada probate ovaj recept, i vi ćete želeti da ga napravite iznova i iznova.\n\nRolat deluje zanimljivo a u isto vreme i prefinjeno, a za decu je, raj za oči i odlična dobitna kombinacija, jer deluje tako razdragano veselo i šaroliko..\n\nNadam se da će te uživati i u pripremi i u ukusu koliko i ja. Odličan je!",
      "imgUrl": "./img/slani_rolat.jpg",
      "qty_1": "5 kom",
      "ingredient_1": "jaja",
      "qty_2": "1 kom",
      "ingredient_2": "jogurt",
      "qty_3": "5 sup. kašika",
      "ingredient_3": "brašno",
      "qty_4": "1/2 kesice",
      "ingredient_4": "prašak za pecivo",
      "qty_5": "180 g",
      "ingredient_5": "kisela pavlaka",
      "qty_6": "300 g",
      "ingredient_6": "šunka",
      "qty_7": "300 g",
      "ingredient_7": "sir (feta sir)",
      "qty_8": "1 šoljica",
      "ingredient_8": "ulje",
      "qty_9": "vrlo malo",
      "ingredient_9": "kuhinjska so",
      "step_1": "Kora: Sastaviti sastojke (jaja, jogurt, ulje, brašno, prašak za pecivo) umutiti sa mikserom i dodati malo soli, a onda razliti masu u pleh obložen papirom za pečenje pa ispeći.",
      "step_2": "Ispečenu koru uviti u nakvašenu, čistu kuhinjsku krpu kao rolat i ostaviti da se ohladi.",
      "step_3": "Fil: Sastaviti zajedno i umutiti mikserom ( feta sir, kiselu pavlaku, iseckanu šunku ). Na ispečenu, ohlađenu koru premazati ovaj fil i ponovo uviti u rolat. Uživajte, preukusno je!",
      "advice": "",
      "posno": false,
      "vegetarijanski": false,
      "ingredients": 9,
      "steps": 3,
      "id": 2
    },
    {
      "recipeCreated": "26.4.2019. 18:50:20",
      "recipeChecked": "26.4.2019. 19:50:20",
      "recipeNumber": 21,
      "views": 0,
      "authorId": 1,
      "category": "Hladna predjela",
      "kitchen": "Univerzalna",
      "preparation": "Lako",
      "personNumber": "2 osobe",
      "timePrep": 25,
      "title": "Punjeni avokado",
      "recipeInfo": "Avokado je jedan od najhranljivijih plodova u prirodi, bogat kalcijumom,kalijumom, magnezijumom i natrijumom. Sadrži vitamin C, B, E, riboflavin i niacin. Avokado je odličan izvor nezasićenih masnih kiselina, a njegova dijetalna vlakna regulišu probavu.\n\nSirov avokado se najčešće koristi za pripremu različitih namaza i salata. Termički obrađen avokado možete dodavati glavnim jelima ili, kao u ovom receptu, da ga napunite povrćem.\n\nU suštini avokado možete da punite bilo kojom kombinacijom sitno naseckanog svežeg ili kuvanog povrća i začinskog bilja. Pustite maštu na volju !",
      "imgUrl": "./img/punjeni_avokado.jpg",
      "qty_1": "2 kom",
      "ingredient_1": "avokado",
      "qty_2": "1 kom",
      "ingredient_2": "paprika",
      "qty_3": "1 kriska",
      "ingredient_3": "sir (koziji)",
      "qty_4": "1 kom",
      "ingredient_4": "paradajz",
      "qty_5": "1 kašika",
      "ingredient_5": "sok od limuna",
      "qty_6": "malo",
      "ingredient_6": "maslinovo ulje",
      "qty_7": "malo",
      "ingredient_7": "kuhinjska so",
      "qty_8": "malo",
      "ingredient_8": "biber u prahu",
      "qty_9": "1",
      "ingredient_9": "mirodjija",
      "step_1": "Plodove avokada operite i isecite uzduž napola. Izvadite košticu. Napravite kockaste zaseke na avokadu.",
      "step_2": "Pomešajte ulje, limunov sok i so i namažite time unutrašnjost plodova. Stavite u rernu zagrejanu do 200 stepeni na 10 minuta.",
      "step_3": "Dok se avokado peče, sitno iseckajte paradajz, papriku i kozji sir. Pomešajte povrće sa naseckanom svežom mirođijom i pobiberite.",
      "step_4": "Kada se avokado ispeče, napunite ga povrćem i ukrasite listićima rukole. Jedite kašićicom zajedno sa „mesom“ avokada. Zbog visoke hranljive vrednosti avokada, ovo jelo je sasvim dovoljno za neku užinu ili čak i večeru.",
      "advice": "",
      "posno": false,
      "vegetarijanski": true,
      "options": "Vegetarijanski",
      "ingredients": 9,
      "steps": 4,
      "id": 3
    },
    {
      "recipeCreated": "26.4.2019. 20:02:40",
      "recipeChecked": "27.4.2019. 00:02:40",
      "recipeNumber": 644,
      "views": 0,
      "authorId": 1,
      "category": "Glavna jela",
      "kitchen": "Francuska",
      "preparation": "Lako",
      "personNumber": "2 osobe",
      "timePrep": 25,
      "title": "Piletina sa bešamel sosom",
      "recipeInfo": "Bešamel sos se koristi kao dodatak mnogim jelima ali i kao osnova za neke sosove.\n\nPostoje razne teorije o tome ko je tvorac bešame sosa, ali najčešće se spominju Francuzi. Isključivo su ga koristili plemići, otuda i verovanje da ga je i prvi otkrio, lični kuvar Luja XIV, koji je u to vreme vladao Francuskom. \n\nLuj XIV se toliko oduševio sosom da ga je i nazvao po svom kuvaru Bešamelu i zahtevao je da bešamel sos bude prisutan stalno na njegovom stolu odnosno stalno na njegovoj trpezi.",
      "imgUrl": "./img/piletina-sa-besamel-sosom.jpg",
      "qty_1": "300 g",
      "ingredient_1": "piletina",
      "qty_2": "100 g",
      "ingredient_2": "brašno",
      "qty_3": "50 g",
      "ingredient_3": "margarin",
      "qty_4": "po potrebi",
      "ingredient_4": "mleko",
      "qty_5": "",
      "ingredient_5": "kuhinjska so",
      "qty_6": "",
      "ingredient_6": "biber u prahu",
      "step_1": "Piletinu izlupati sa obe strane (usoliti) i pržiti na laganoj vatri, dok ne porumeni i sa jedne i sa druge strane.",
      "step_2": "U tiganju rastopiti margarin, pa dodavati brašno, ali pomalo i mešati konstantno na tihoj vatri, ( ne dozvoliti da se stvore grudvice) iz tog razloga treba više puta dodavati brašno ali po malo i mleka po potrebi. Kada je sve gotovo sastaviti sa prženom piletinom i servirati.",
      "advice": "Ukoliko vam je meso malo masnije,  čvrsto ga zatvorite u foliju, da bi sačuvali sok.",
      "posno": false,
      "vegetarijanski": false,
      "ingredients": 6,
      "steps": 2,
      "id": 4
    },
    {
      "recipeCreated": "27.4.2019. 20:18:14",
      "recipeChecked": "28.4.2019. 09:18:14",
      "recipeNumber": 140,
      "views": 0,
      "authorId": 1,
      "category": "Glavna jela",
      "kitchen": "Srpska",
      "preparation": "Srednje",
      "personNumber": "6 osoba",
      "timePrep": 45,
      "title": "Punjene paprike",
      "recipeInfo": "Punjene paprike pripadaju srpskoj kuhinji ali, ne baš kao nacionalno jelo, zbog raznolikih uticaja koje su Srbi primili kroz burna istorijska događanja, pa se tako punjene papirke prave i jedu i u drugim državama.\n\nSastojci za pripremu nisu skupi a jelo je toliko ukusno i izdašno i možete ga praviti u svim godišnjim dobima, nećete pogrešiti.\n\nJelo sa puno ukusa kao i  povrća i proteina.",
      "imgUrl": "./img/punjene_paprike.jpg",
      "qty_1": "2 glavice",
      "ingredient_1": "crni luk",
      "qty_2": "500 g",
      "ingredient_2": "mleveno meso",
      "qty_3": "1 šolja",
      "ingredient_3": "pirinač",
      "qty_4": "2 kom",
      "ingredient_4": "krompir",
      "qty_5": "2 čena",
      "ingredient_5": "beli luk",
      "qty_6": "12 kom",
      "ingredient_6": "paprike",
      "qty_7": "",
      "ingredient_7": "kuhinjska so",
      "qty_8": "",
      "ingredient_8": "biber u prahu",
      "qty_9": "",
      "ingredient_9": "mešavina začina",
      "qty_10": "",
      "ingredient_10": "crvena paprika u prahu",
      "step_1": "Propržiti na vrelom ulju crni luk, a nakon minut, dva dodati i beli, jer se beli brže prži.",
      "step_2": "Čim luk dobije zlatnu bojicu, dodati i mleveno meso i promešati sve zajedno. Kroz minut, dva dodati čašu vode i mešati sve zajedno još dodatnih 6-7 minuta. Dok mešate, dodajete i začine ( so, biber, mešavinu začina, crvenu tucanu papriku ), pa i 1/3 povrtne kockice ako imate.",
      "step_3": "Nakon toga dodate pirinač u sve to i samo promešate sve zajedno i sklonite sa vatre.",
      "step_4": "Uključite rernu da se zagreje, pa pripremite ( operete, očistite paprike) i punite ih i zatvarate krompirom, brašnom ili paradajzom, a zatim ih ređajte u pleh bez da ste ga prethodno podmazali uljem.",
      "step_5": "Na kraju, saspete u pleh između paprika, svu vodicu koja vam je ostala u šerpi u kojoj je bila smesa za punjenje paprika, ukoliko vam nije ostalo puno, niti malo, onda slobodno u posebnu čašu dodajte ako imate malo paradajz sosa i pomešajte sa vodom i sa malo vegete, pa saspite pored paprika ili prosto dolite jos vrlo malo vode, koja će omogućiti pirinču da se bolje skuva. \n\nStavite i aluminijumsku foliju preko paprika, jer će i ona takođe pomoći pirinču pri kuvanju. Pečete paprike na 250 stepeni 45 min.",
      "advice": "",
      "posno": false,
      "vegetarijanski": false,
      "ingredients": 10,
      "steps": 5,
      "id": 5
    },
    {
      "recipeCreated": "27.4.2019. 20:29:17",
      "recipeChecked": "28.4.2019. 16:29:17",
      "recipeNumber": 463,
      "views": 0,
      "authorId": 1,
      "category": "Salate",
      "kitchen": "Ruska",
      "preparation": "Lako",
      "personNumber": "4 osobe",
      "timePrep": 20,
      "title": "Ruska salata",
      "recipeInfo": "Ruska salata je tradicionalna ruska salata, koja se priprema sa majonezom, kuvanim krompirom, šargarepom, kiselim krastavčićima, šunkom, kuvanim jajima, a ponekad i sa različitim vrstama kobasica ili sa kuvanom piletinom.\n\nOva salata je poznata u mnogim evropskim zemljama, ali ne i uvek pod istim imenom. U nekim zemljama (npr. Italija, Francuska, Španija, Makedonija, Bugarska itd.) poznata je kao \"ruska salata\", a u Ukrajini, Nemačkoj, SAD, Velikoj Britaniji  poznata je pod nazivom \"Olivierova salata\" ili \"francuska salata\".\n\n Odličan je pratilac uz meso a kod nas je a verujem i kod mnogih drugih neizostavno jelo ili salata za Novu Godinu i razne proslave; nekada se servira kao salata a nekada samo kao predjelo.\n\nUživajte !",
      "imgUrl": "./img/ruska_salata.jpg",
      "qty_1": "450 g",
      "ingredient_1": "povrće za rusku salatu",
      "qty_2": "250 g",
      "ingredient_2": "stišnjena šunka",
      "qty_3": "3 kom",
      "ingredient_3": "jaja",
      "qty_4": "200 g",
      "ingredient_4": "piletina",
      "qty_5": "4 kom",
      "ingredient_5": "kiseli krastavac",
      "qty_6": "300 g",
      "ingredient_6": "majonez",
      "qty_7": "",
      "ingredient_7": "kuhinjska so",
      "step_1": "Ukuvati povrće u jednoj posudi, drugoj belo meso a u trećoj jaja ( jedno 15-ak minuta ).",
      "step_2": "Kada je sve kuvano, iseckati belo meso, kisele krastavčiće, šunku, i jaja. Sjediniti sve u jednu posudu pa pomešati sa majonezom.",
      "advice": "",
      "posno": false,
      "vegetarijanski": false,
      "ingredients": 7,
      "steps": 2,
      "id": 6
    },
    {
      "recipeCreated": "27.4.2019. 20:41:38",
      "recipeChecked": "28.4.2019. 16:41:38",
      "recipeNumber": 269,
      "views": 0,
      "authorId": 2,
      "category": "Salate",
      "kitchen": "Grčka",
      "preparation": "Lako",
      "personNumber": "4 osobe",
      "timePrep": 25,
      "title": "Grčka salata",
      "recipeInfo": "Tradicionalna svima nama dobro poznata, osvežavajuća grčka salata napravljena u kombinaciji paradajza, feta sira, maslina začinjena origanom, prelivena maslinovim uljem. Veoma hranljiva i neodoljivog ukusa.",
      "imgUrl": "./img/grcka-salata.jpg",
      "qty_1": "400 g",
      "ingredient_1": "paradajz",
      "qty_2": "2 glavice",
      "ingredient_2": "crni luk",
      "qty_3": "100 g",
      "ingredient_3": "crne masline",
      "qty_4": "200 g",
      "ingredient_4": "feta sir",
      "qty_5": "1 kom",
      "ingredient_5": "krastavac",
      "qty_6": "",
      "ingredient_6": "ulje",
      "qty_7": "",
      "ingredient_7": "sirće",
      "qty_8": "",
      "ingredient_8": "kuhinjska so",
      "qty_9": "",
      "ingredient_9": "biber u prahu",
      "step_1": "Izabrati krupne, čvrste i zrele paradajze, oprati ih i iseći na kolutove.",
      "step_2": "Crni luk očistiti, oprati, i iseći ga na kolutove, pa odvojiti prstenove. I fetu iseći na kockice.",
      "step_3": "Na veliki tanjir ili plitku činiju ređati paradajz,luk i sir naizmenično. Svaki red soliti, biberiti i prelivati uljem.\nUkrasiti maslinama i služiti odmah.",
      "advice": "",
      "posno": false,
      "vegetarijanski": false,
      "ingredients": 9,
      "steps": 3,
      "id": 7
    },
    {
      "recipeCreated": "27.4.2019. 20:46:58",
      "recipeChecked": "28.4.2019. 13:46:58",
      "recipeNumber": 753,
      "views": 0,
      "authorId": 1,
      "category": "Kolači",
      "kitchen": "Italijanska",
      "preparation": "Lako",
      "personNumber": "4 osobe",
      "timePrep": 20,
      "title": "Tiramisu",
      "recipeInfo": "Ovaj kolač, poreklom iz Italije, uvek će vas iznenaditi, kako ukusom, tako i lakoćom pripreme.",
      "imgUrl": "./img/tiramisu-kolac-desert.jpg",
      "qty_1": "2 kutije",
      "ingredient_1": "piškote",
      "qty_2": "4 kom",
      "ingredient_2": "jaja",
      "qty_3": "80 g",
      "ingredient_3": "šećer",
      "qty_4": "250 g",
      "ingredient_4": "kajmak",
      "qty_5": "200 g",
      "ingredient_5": "šlag",
      "qty_6": "1 kom",
      "ingredient_6": "crna čokolada",
      "step_1": "Najpre natopite piškote u kafi.\nZa fil je potrebno pomešati 4 žumanca, šećer i kajmak. Mutite sve dok se masa ne sjedini.",
      "step_2": "Posebno umutiti šlag i sjediniti sa prethodno spremljenom masom.",
      "step_3": "Ređajte piškote, pa preko njih fil i to ponovite dvaput. Zatim narendati odozgo crnu čokoladu. Ohladite i uživajte !",
      "advice": "",
      "posno": false,
      "vegetarijanski": false,
      "ingredients": 6,
      "steps": 3,
      "id": 8
    },
    {
      "recipeCreated": "28.4.2019. 20:51:30",
      "recipeChecked": "29.4.2019. 06:51:30",
      "recipeNumber": 319,
      "views": 1,
      "authorId": 1,
      "category": "Kolači",
      "kitchen": "Univerzalna",
      "preparation": "Lako",
      "personNumber": "4 osobe",
      "timePrep": 25,
      "title": "Kocke od kokosa",
      "recipeInfo": "Prefinjena neodoljiva kombinacija kokosa i duboke tamne čokolade, upotpunjena čokoladnom glazurom. Bogato uživanje za sve ljubitelje kokosa i čokolade.",
      "imgUrl": "./img/kocke-od-kokosa.jpg",
      "qty_1": "250 g",
      "ingredient_1": "kokosovo brašno",
      "qty_2": "250 g",
      "ingredient_2": "keks (mleveni)",
      "qty_3": "250 g",
      "ingredient_3": "šećer u prahu",
      "qty_4": "125 g + 50 za preliv",
      "ingredient_4": "margarin",
      "qty_5": "5 štangli",
      "ingredient_5": "crna čokolada",
      "step_1": "Na blagoj temperturi otopiti u vrlo malo vode, šećer i margarin i dodati kokos i keks. Oblikovati na dasci ili u tepsiji kolač četvrtastog oblika.",
      "step_2": "Kada se stegne preliti ga glazurom koja se priprema na sledeći način: na blagoj temperaturi otopiti u posudi margarin i čokoladu, pa vrelo preliti preko kolača.",
      "advice": "Kolač ćete najlakše iseći koncem. Možda ovo niste znali ali pokušajte, jer je zaista efikasno. Prvo oštrim nožem obeležite presek i oko njega stavite jak konac. Krajeve konca prebacite unakrst i lagano zatežete. Tako ćete kolač preseći uvek ravnomerno na pola ili već na više delova.\nZa glazuru, mislim da već znate ; Ukoliko želite da glazura na kolačićima ima i poseban sjaj, dodajte na 100 g čokolade jednu kašičicu masnoće od kokosovog oraha ili pored maslaca dodajte i kašiku ulja.\n\nA pre nego prelijete glazuru na kolač, slobodno prvo premažite kolač tankim slojem marmelade da ne bi testo upilo glazuru.",
      "posno": false,
      "vegetarijanski": false,
      "ingredients": 5,
      "steps": 2,
      "id": 9
    },
    {
      "recipeCreated": "28.4.2019. 20:57:11",
      "recipeChecked": "29.4.2019. 02:57:11",
      "recipeNumber": 976,
      "views": 0,
      "authorId": 2,
      "category": "Torte",
      "kitchen": "Univerzalna",
      "preparation": "Lako",
      "personNumber": "2 osobe",
      "timePrep": 25,
      "title": "Plazma torta",
      "recipeInfo": "Nepogrešiv spoj sastojaka sjedinjenih sa plazma keksom  i natopljenim osvežavajućim sokom od narandže, ovaj desert čine neodoljivo laganim, ukusnim, umereno slatkim i sočnim  slatkišem, za sve prilike.\n\nTortica za sve ukuse! Da li zaista postoji neko ko ne voli plazma torticu :) Mislim da se taj još nije rodio :)",
      "imgUrl": "./img/plazma_torta.jpg",
      "qty_1": "50-100 g",
      "ingredient_1": "žele kocke",
      "qty_2": "50 g",
      "ingredient_2": "crna čokolada",
      "qty_3": "125 g + 50 g za preliv",
      "ingredient_3": "margarin",
      "qty_4": "300 g",
      "ingredient_4": "plazma keks",
      "qty_5": "100 ml",
      "ingredient_5": "sok od narandže",
      "step_1": "Napravimo prvo, koru od keksa i margarina, tako što pomešamo margarin, keks i žele kocke u jednu činiju u koju polako dolivamo sok od pomorandže. Mešajte rukama dok se svi sastojci dobro ne sjedine i po potrebi dodati još soka. Masa treba da bude gusta ali opet ne i pregusta i nikako ne presuva, da bi mogla da se fino oblikuje. Oblikujete masu u obliku koji želite, ja obično pravim u obliku srca :) i na kuhinjskoj dasci, jer mi je tako najlakše. A onda ostavite u frižider da se malo ohladi, tj.stegne.",
      "step_2": "Za to vreme, u posudu za kuvanje stavimo 50 grama margarina, 2-3 kašike vode, 2 kašike šećera i čokladu. Mešamo na tihoj vatri dok se ne rastopi, pa kad proključa skinuti.",
      "step_3": "Izvadite tortu i prelijete celu površinu čokoladom i stavite odozgo komade preostalih žele kocki.. A onda opet vratimo tortu u frižider da se još malo ohladi i bolje stegne. Brzo i prijatno iznenadjenje sa svakoga!",
      "advice": "Imajte u vidu da je ovo M-I-N-I plazma torta, što možete videti i po k-o-l-i-č-i-n-i sastojaka. Ovo je čisto malo brzinsko iznenađenje za već nekog vama dragog.",
      "posno": false,
      "vegetarijanski": false,
      "ingredients": 5,
      "steps": 3,
      "id": 10
    },
    {
      "recipeCreated": "29.4.2019. 21:06:26",
      "recipeChecked": "29.4.2019. 23:09:21",
      "recipeNumber": 928,
      "views": 0,
      "authorId": 1,
      "category": "Kolači",
      "kitchen": "Univerzalna",
      "preparation": "Lako",
      "personNumber": "2 osobe",
      "timePrep": 25,
      "title": "Palačinke od heljde i rogača",
      "recipeInfo": "Jako su interesantne , ako pravite male palačinke. Ja ih poslužujem sa javorovim ili čokoladnim sirupom, domaćim džemom, pastom od lješnjaka (zdravija varijanta eurokrema) i u sezoni - sa bobičastim voćem.\nDodavanjem rogača u palačinke, postićete nezaboravan \"čokoladni\" okus palačinaka i zamamljivu boju.",
      "imgUrl": "./img/palacinke_od_heljde.jpg",
      "qty_1": "3 kašike",
      "ingredient_1": "brašno",
      "qty_2": "3 kašike ",
      "ingredient_2": "heljdino brašno",
      "qty_3": "malo",
      "ingredient_3": "prašak za pecivo",
      "qty_4": "3 kašike",
      "ingredient_4": "rogač (mleveni)",
      "qty_5": "1 čaša",
      "ingredient_5": "mineralna voda",
      "qty_6": "1 kašika",
      "ingredient_6": "ulje",
      "step_1": "Pomešajte 3 kašike pšeničnog belog brašna, 3 kašike heljdinog brašna i 3 kašike rogača. Dodati na vrh noža prašak za pecivo, kašiku ulja i vode po potrebi. Umutiti smesu mikserom.",
      "step_2": "Peći u tiganju, postepeno smanjujući temperaturu. (Tokom pečenja, vodite računa da postepeno smanjujete temperaturu, kako palačinke ne bi izgorele). Pecite palačinke na minimalnog količini ulja.",
      "step_3": "Za posluživanje, premazati javorovim sirupom ili domaćim džemom.",
      "advice": "Za pravljenje palačinaka bez jaja, potrebno je strpljenje! Možda palačinke neće uspjeti prvi puta, ali nemojte da vas to pokoleba.",
      "posno": true,
      "vegetarijanski": true,
      "options": "Vegetarijanski",
      "ingredients": 6,
      "steps": 3,
      "id": 11
    },
    {
      "recipeCreated": "29.4.2019. 21:16:34",
      "recipeChecked": "30.4.2019. 18:16:34",
      "recipeNumber": 772,
      "views": 0,
      "authorId": 2,
      "category": "Supe i čorbe",
      "kitchen": "Univerzalna",
      "preparation": "Lako",
      "personNumber": "4 osobe",
      "timePrep": 25,
      "title": "Potaž od krompira i pečene cvekle",
      "recipeInfo": "Ova slatkasto-ljuta krem čorba obogaćena ukusom kokosa i pikantnih začina postala je jedna od mojih omiljenih varijanti za ručak. Cvekla i krompir su dostupni tokom cele godine i dobro zasite. Kokosovo mleko i začini mogu da se nađu u prodavnicama zdrave hrane, a često i u velikim supermarketima.\n\nJoš jedna prednost ove čorbice je njena vedra pink boja koja će razvedriti najsivlje dane. ",
      "imgUrl": "./img/potaz_od_krompira.jpg",
      "qty_1": "6 kom (600 g)",
      "ingredient_1": "krompir",
      "qty_2": "2-3 (400-500 g)",
      "ingredient_2": "cvekla",
      "qty_3": "200-300 ml",
      "ingredient_3": "mleko",
      "qty_4": "1 kom",
      "ingredient_4": "limun",
      "qty_5": "2-3 čena",
      "ingredient_5": "beli luk",
      "qty_6": "",
      "ingredient_6": "kuhinjska so",
      "qty_7": "",
      "ingredient_7": "biber u prahu",
      "qty_8": "",
      "ingredient_8": "kumin",
      "qty_9": "1 čašica",
      "ingredient_9": "Čili - krupna paprika",
      "step_1": "Zagrejte rernu do 200°C. Operite cveklu i stavite da se peče u plehu, sve sa korom. Ako je cvekla velika, isecite je na pola. Pecite u rerni oko sat vremena.",
      "step_2": "Dok se cvekla peče, oljuštite krompir, naseckajte ga na komadiće i kuvajte dok ne omekša (oko pola sata). Posolite vodu kada provri. Kada se krompir skuva, nemojte prosuti vodu u kojoj se kuvao, trebaće kasnije za čorbu.",
      "step_3": "Gotovu cveklu izvadite iz rerne i ohladite. Oljuštite je rukama, naseckajte i izmiksajte u blenderu ili štapnim mikserom. Dodajte krompir, začine, sok limuna, beli luk, kokosovo mleko, so i biber. Izmiksajte sve zajedno dok ne postane homogena masa. Dodajte par šolja vode u kojoj se kuvao krompir kako biste dobili željenu gustinu čorbe.",
      "step_4": "Zagrejte potaž ukoliko je potrebno. Kada služite, možete da ukrasite čorbu svežim začinskim biljem, semenkama, mrvljenim lešnikom ili pahuljicama čili papričice.",
      "advice": "Nikad nisam bila ljubitelj cvekle, ali u ovom receptu cvekla se jedva oseća i oduševiće svojim ukusom čak i one koji ne vole ovo povrće.",
      "posno": false,
      "vegetarijanski": true,
      "ingredients": 9,
      "steps": 4,
      "id": 12
    },
    {
      "recipeCreated": "29.4.2019. 17:00:32",
      "recipeChecked": "30.4.2019. 03:00:32",
      "recipeNumber": 250,
      "views": 0,
      "authorId": 3,
      "category": "Glavna jela",
      "kitchen": "Kineska",
      "preparation": "Lako",
      "personNumber": "3 osobe",
      "timePrep": 25,
      "title": "Rižoto sa goveđim mesom",
      "recipeInfo": "Jelo sa puno ukusa i bogatom kombinacijom boja i mirisa povrća koje se fantastično uklapa  uz meso i jela od piletine. Uživajte u ovom istinski ukusnom pa pomalo i gurmanskom obroku jer je vrlo zasitno jelo.\n\nRižoto je nastao  u Španiji ali je zastupljeno i u kineskoj tradicionalnoj kuhinji, kao i našoj, makedonskoj...itd. Glavni sastojak rižota je riža ( pirinač), po čemu je i dobilo ime, osim riže, tu je i povrće smrznuto ili sezonsko, crni luk  kao i začini i soja sos.",
      "imgUrl": "./img/rižoto.jpg",
      "qty_1": "300 g",
      "ingredient_1": "goveđe meso (može i pileće meso)",
      "qty_2": "450 g",
      "ingredient_2": "rižoto",
      "qty_3": "",
      "ingredient_3": "kuhinjska so",
      "qty_4": "",
      "ingredient_4": "biber u prahu",
      "step_1": "U šerpu stavimo malo ulja da se zagreje na tihoj vatri, a odmah potom stavimo i rižoto. Kuvamo ga 15-ak min. i pri tom dok mešamo dodajemo u šerpu i malo vode (do čašu-dve). \n\nKada grašak i pirinač omekšaju, što ćete i videti. Skinete sa šporeta i začinite po svom ukusu. Dodate soli, bibera koliko vi želite.",
      "step_2": "U tiganju sa vrlo malo ulja uz vrlo malo ili čak nikako luka, po vašem izboru, ispržiti belo meso koje ćete iseckati na komadiće, kockice ili listiće, a zatim sastavite sve zajedno, i ručak vam je već gotov!",
      "advice": "Nije toliko poznato ali  je delotvorno, da će meso koje nameravate da pržite, biti daleko ukusnije i mekše, ukoliko ga prethodno neke vreme držite u mleku ili verujem već većini poznato, ukoliko meso namažete senfom i sa jedne i sa druge strane i ostavite u frižider 2-3 sata pre prženja, da će dobiće na ukusu.",
      "posno": false,
      "vegetarijanski": false,
      "ingredients": 4,
      "steps": 2,
      "id": 13
    },
    {
      "recipeCreated": "29.4.2019. 17:09:31",
      "recipeChecked": "30.4.2019. 10:09:31",
      "recipeNumber": 871,
      "views": 0,
      "authorId": 3,
      "category": "Glavna jela",
      "kitchen": "Univerzalna",
      "preparation": "Lako",
      "personNumber": "4 osobe",
      "timePrep": 25,
      "title": "Pilav na najlakši način",
      "recipeInfo": "Pilav ili već \"ukus detinjstva\", složiće se mnogi. Svi smo kao mali voleli da vidimo hrskave korice piletine uronjene u sočni pirinač..mmm..nezaboravno.\n\nPilav se može napraviti na bezbroj načina ili već gotovo od svega što u tom momentu imate u frižideru.\n \nPirinač ne bi trebalo kuvati duže od 15-ak minuta da ne bi postao  lepljiv i gnjecav a da bi  zadržao i lep izgled a i naravno da bi prvenstveno zadržao svoje nutritivne vrednosti. Jer ne zaboravimo da je pirinač, posle pšenice, najčešće korišćena žitarica u svetu, jer sadrži veliki procenat ugljenih hidrata - što znači da ima veliku energetsku vrednost a nizak sadržaj proteina i masti. \n\nPored ugljenih hidrata ima dosta hranljivih sastojaka kao što su biljna vlakna, minerali i vitamini (vitamin B), koji deluje umirujuće na nervni sistem a od minerala su zastupljeni i kalijum  i kalcijum i fosfor i magnezijum i cink i gvožđe.",
      "imgUrl": "./img/pilav_sa_mesom.jpg",
      "qty_1": "3-4 kom (manja)",
      "ingredient_1": "pileći batak",
      "qty_2": "240 g (2 kom)",
      "ingredient_2": "paprike (šilje)",
      "qty_3": "2-3 kom",
      "ingredient_3": "beli luk",
      "qty_4": "1 kom (manji)",
      "ingredient_4": "crveni luk",
      "qty_5": "1 kom",
      "ingredient_5": "crni luk",
      "qty_6": "100 g",
      "ingredient_6": "šargarepa",
      "qty_7": "1 šolja",
      "ingredient_7": "pirinač",
      "qty_8": "",
      "ingredient_8": "kuhinjska so",
      "qty_9": "",
      "ingredient_9": "biber u prahu",
      "qty_10": "",
      "ingredient_10": "mešavina začina",
      "step_1": "\nIseći paprike na kockice, krugove ili kolutove.",
      "step_2": "\nIseći beli luk što sitnije.",
      "step_3": "\nIseći crveni luk, na polumesece ili kako vi želite.",
      "step_4": "\nIseći crni luk isto kao i crveni luk.",
      "step_5": "Iseckati šargarepu na kružiće.",
      "step_6": "Sve iseckane sastojke zajedno sastavite, sjedinite sa batačićima (možete i batačiće sitnije malo iseckati), pouljite, izmešate zajedno; začinite i stavite u pleh i pečete najpre 30 minuta u prethodno malo zagrejanoj rerni na 250 stepeni.",
      "step_7": "Nakon 30 minuta izvadite iz rerne i preko toga prelijete šolju pirinča i dve šolje vode i začinite još malo ukoliko je potrebno.",
      "step_8": "Vratite u rernu i pečete još 20-ak minuta na 200 stepeni.",
      "advice": "Tako ukoliko odete na odmor u Japan ili Kinu, nećete sigurno ostati gladni, jer ukoliko vam se ne svidi prilog uz prinač, uvek možete jesti pirinač koji je neizostavni deo svake trpeze. Obrok koji je uvek sastavljen od kuvanog pirinča i prilozi oko kojih se već dogovaraju (da li povrće, da li riba, da li meso ili već neki drugi dodatak).",
      "posno": false,
      "vegetarijanski": false,
      "ingredients": 10,
      "steps": 8,
      "id": 14
    },
    {
      "recipeCreated": "30.4.2019. 17:23:24",
      "recipeChecked": "30.4.2019. 21:23:24",
      "recipeNumber": 131,
      "views": 1,
      "authorId": 4,
      "category": "Salate",
      "kitchen": "Srpska",
      "preparation": "Lako",
      "personNumber": "2 osobe",
      "timePrep": 25,
      "title": "Salata od krompira",
      "recipeInfo": "Ova salata je odličan prilog uz riblje specijalitete a i prednost ove salate  je što može da se služi i topla i hladna.",
      "imgUrl": "./img/krompir_salata.jpg",
      "qty_1": "250 g",
      "ingredient_1": "krompir",
      "qty_2": "1/2 glavice",
      "ingredient_2": "crni luk",
      "qty_3": "1/2 kašike",
      "ingredient_3": "ulje",
      "qty_4": "1 kašika",
      "ingredient_4": "sirće",
      "qty_5": "1/2 kašičice",
      "ingredient_5": "kuhinjska so",
      "qty_6": "1/2 kašičice",
      "ingredient_6": "biber u prahu",
      "step_1": "Krompir najpre oljuštite i stavite u hladnu vodu da se kuva u koju ste prethodno stavili vrlo malo soli. Kada je krompir skuvan, izvadite iz vode ili već procedite i ostavite da se malo ohladi a zatim ga isečete na deblje kolutove (4-5 cm), da se prilikom mešanja ne bi raspao.",
      "step_2": "Zatim očistite i isečete luk na tanke listiće.",
      "step_3": "U posebnu posudicu sastavite zajedno i promešate biber, sirće i ulje.",
      "step_4": "Sve to na kraju sjedinite (krompir + luk + preliv) i dodate još malo soli (pola kašičice ili po ukusu, već) i promešate lagano.",
      "advice": "",
      "posno": true,
      "options": "Posno, Vegetarijanski",
      "vegetarijanski": true,
      "ingredients": 6,
      "steps": 4,
      "id": 15
    },
    {
      "recipeCreated": "30.4.2019. 17:28:05",
      "recipeChecked": "1.5.2019. 07:28:05",
      "recipeNumber": 25,
      "views": 2,
      "authorId": 4,
      "category": "Hladna predjela",
      "kitchen": "Univerzalna",
      "preparation": "Lako",
      "personNumber": "2 osobe",
      "timePrep": 15,
      "title": "Mini sendviči",
      "recipeInfo": "Ovi mali , ukusni sendviči od sira i salame su meni toliko savršeni i toliko dobri da će ih čak najprobirljiviji jesti, verujte.. a znate li zašto ?\n\nUpravo zato što se ne treba miriti sa običnom šunkom i sirom, kada možete učiniti i nešto slasno i drugačije.\n\nDodajte namaz sa belim lukom koji savršeno upotpunjuje šunku.",
      "imgUrl": "./img/mini_sendvici.jpg",
      "qty_1": "po želji",
      "ingredient_1": "šunka",
      "qty_2": "po želji",
      "ingredient_2": "beli luk (namaz od belog luka)",
      "qty_3": "po želji",
      "ingredient_3": "kačkavalj",
      "qty_4": "po želji",
      "ingredient_4": "zelene masline",
      "step_1": "Male kajzerice iseći na pola.",
      "step_2": "Staviti namaz od belog luka, preko šunku, kačkavalj i maslinu za kraj :)",
      "advice": "Sendviče možete i da malo zapečete u rerni, nekoliko minuta, biće podjednako sočni, ukusni i dobri.",
      "posno": false,
      "vegetarijanski": false,
      "ingredients": 4,
      "steps": 2,
      "id": 16
    },
    {
      "recipeCreated": "30.4.2019. 17:35:24",
      "recipeChecked": "30.4.2019. 20:35:24",
      "recipeNumber": 391,
      "views": 1,
      "authorId": 3,
      "category": "Pite i testa",
      "kitchen": "Italijanska",
      "preparation": "Srednje",
      "personNumber": "4 osobe",
      "timePrep": 35,
      "title": "Testenina sa tunjevinom",
      "recipeInfo": "Dok su Sicilijanci jeli pastu bez ičega Fiorentinci su je uveliko jeli sa šećerom, sa sirom, sa povrćem pa i ribom. Oni su već uveliko napredovali, ali je bila dostupna samo bogatima i pravila se ručno.",
      "imgUrl": "./img/testenina-sa-tunjevinom.jpg",
      "qty_1": "500 g",
      "ingredient_1": "makarone",
      "qty_2": "2 x 100 g",
      "ingredient_2": "tunjevina (konzerva)",
      "qty_3": "4 čena",
      "ingredient_3": "beli luk",
      "qty_4": "2 velike kašike",
      "ingredient_4": "prezle",
      "qty_5": "1 kom",
      "ingredient_5": "kocka za supu",
      "qty_6": "1,5 dl",
      "ingredient_6": "belo vino",
      "qty_7": "",
      "ingredient_7": "kuhinjska so",
      "qty_8": "",
      "ingredient_8": "biber u prahu",
      "qty_9": "malo",
      "ingredient_9": "peršun",
      "step_1": "Beli luk očistimo i iseckamo sitno na kockice.",
      "step_2": "Takodje, operemo, očistimo i sitno iseckamo i peršun.",
      "step_3": "Zajedno 5-6 min. propržimo na maslinovom ulju odnosno, ulju koje iscedimo iz konzerve sa ribom; a odmah potom dodamo i tunjevinu; sve zajedno mešamo 5-6 minuta a zatim dodamo i vino koje opet dodatnih 5-6 minuta mešamo, dok ne ispari a zatim začinimo ili već dodamo soli i bibera, po želji.",
      "step_4": "Nakon toga, dodamo čašu ili dve vode i jednu povrtnu kockicu, i kada vidite da to provri nakon nekoliko minuta, dodaćete kašiku do dve prezli ( pažljivo, pripazite da ne bude pregusto). ",
      "step_5": "Sve zajedno sjedinjeno, potrebno je mešati 5 minuta na laganoj vatri i nakon toga spremni ste da servirate jelo.",
      "step_6": "Jelo se servira uz makarone ili špagete. Koje pripremita na sledeći način: U dubokom loncu sa vrlo malo ulja i soli, stavite vodu da proključa. Tek kada voda proključa, dodati testenine, i smanjiti temperaturu. Testenine kuvate u nepoklopljenom loncu desetak minuta...",
      "step_7": "Izvadite, procedite, sastavite sa sosom od tune i dekorišite ukoliko želite sa svežim sitno seckanim peršunom...",
      "advice": "Sos od paradajza koji se vrlo često koristi za pastu, biće daleko ukusniji ako mu dodate čašu kisele pavlake.",
      "posno": false,
      "vegetarijanski": true,
      "options": "Vegetarijanski",
      "ingredients": 9,
      "steps": 7,
      "id": 17
    },
    {
      "recipeCreated": "1.5.2019. 17:41:39",
      "recipeChecked": "2.5.2019. 00:41:39",
      "recipeNumber": 231,
      "views": 0,
      "authorId": 4,
      "category": "Hladna predjela",
      "kitchen": "Srpska",
      "preparation": "Lako",
      "personNumber": null,
      "timePrep": 15,
      "title": "Kuvana punjena jaja",
      "recipeInfo": "Sa ovim, tako jednostavnim super lakim predjelom, oduševila sam sve svoje goste na zabavi, još sam se posebno pozabavila sa dekoracijom i samim serviranjem, gde sam oduševila i samu sebe i došla do zaključka da je zaista dekorisanija hrana i ukusnija.",
      "imgUrl": "./img/kuvana_punjena_jaja.jpg",
      "qty_1": "",
      "ingredient_1": "jaja kuvana",
      "qty_2": "",
      "ingredient_2": "šunka",
      "qty_3": "",
      "ingredient_3": "kiseli krastavčići",
      "qty_4": "",
      "ingredient_4": "kisela pavlaka",
      "qty_5": "",
      "ingredient_5": "majonez",
      "step_1": "Najpre, jedno desetak minuta u vreloj vodi jaja obarati, a zatim u drugoj posudi sa hladnom vodom, rashladiti.",
      "step_2": "Očistiti ljusku, preseći ih na pola i izvaditi žumance.",
      "step_3": "Žumance, zatim sjedinite sa kiselom pavlakom, kiselim krastavčićima, majonezom i izgnječite viljuškom i promešajte a onda zatim kašičicom punite belanca i ostavite u frižideru da odstoje pre služenja. A ukoliko vam belanca ne stoje na tacni kako bi trebalo, samo malo odsecite dno i videćete šta će se desiti. Peršun možete da iskoristite za dekoraciju.",
      "advice": "Probajte ! Izuzetno je ukusno, nema greške a dekorišite već po vašoj želji, budite sam svoj kreator !",
      "posno": false,
      "vegetarijanski": true,
      "options": "Vegetarijanski",
      "ingredients": 5,
      "steps": 3,
      "id": 18
    },
    {
      "recipeCreated": "1.5.2019. 18:27:07",
      "recipeChecked": "2.5.2019. 08:27:07",
      "recipeNumber": 141,
      "views": 0,
      "authorId": 3,
      "category": "Kolači",
      "kitchen": "Bosanska",
      "preparation": "Srednje",
      "personNumber": "4 osobe",
      "timePrep": 30,
      "title": "Čokoladni sufle",
      "recipeInfo": "Mnogi su rekli da je ovaj kolač nemoguće napraviti iz prve!? Dokažite suprotno!\nČokoladni sufle, vrhunac kulinarskog umeća. Spolja hrskav, iznutra kremast. Praznik za čulo ukusa.",
      "imgUrl": "./img/cokoladni-sufle-desert.jpg",
      "qty_1": "4 kom",
      "ingredient_1": "jaja",
      "qty_2": "220 g",
      "ingredient_2": "crna čokolada",
      "qty_3": "230 g",
      "ingredient_3": "maslac",
      "qty_4": "120 g",
      "ingredient_4": "šećer",
      "qty_5": "120 g",
      "ingredient_5": "brašno",
      "step_1": "Umutiti jaja, šećer, i brašno.",
      "step_2": "Posebno na šporetu lagano istopiti čokoladu sa maslacem; zatim to, sjediniti u prethodno umućenu masu od (jaja, brašna i šećera).",
      "step_3": "Priprema jeste do 20-ak minuta ali imajte u vidu da se napravljena smesa, mora, najpre ohladiti jedno 2-3 sata pre pečenja. Smesom puniti do 2/3 modle. Peći u zagrejanoj rerni na 250 stepeni tačno 7 minuta.",
      "advice": "",
      "posno": false,
      "vegetarijanski": true,
      "options": "Vegetarijanski",
      "ingredients": 5,
      "steps": 3,
      "id": 19
    },
    {
      "recipeCreated": "1.5.2019. 18:33:38",
      "recipeChecked": "1.5.2019. 23:33:38",
      "recipeNumber": 485,
      "views": 3,
      "authorId": 4,
      "category": "Pite i testa",
      "kitchen": "Italijanska",
      "preparation": "Srednje",
      "personNumber": "2 osobe",
      "timePrep": 30,
      "title": "Ravioli sa pršutom",
      "recipeInfo": "Testenine su poznato tradicionalno italijansko jelo. Da li znate da svaki čak region u Italiji ima svoju priču o testeninama. Ako odete u Italiju a ne probate njihove testenine, verujte mi, to vam je kao i da niste bili tamo. Zato ako se odlučite da krenete na put za Italiju, ne propustite da tom prilikom stanete i rezancima na put.  :)",
      "imgUrl": "./img/Ravioli-sa-pršutom.jpg",
      "qty_1": "250 g",
      "ingredient_1": "ravioli sa pršutom",
      "qty_2": "50 g",
      "ingredient_2": "pršut (svinjski ili govedji)",
      "qty_3": "17 g",
      "ingredient_3": "supa od pečuraka (aleva- Quick-Instant krem supa)",
      "qty_4": "250 g",
      "ingredient_4": "pavlaka za kuvanje",
      "qty_5": "4 čena",
      "ingredient_5": "beli luk",
      "qty_6": "vrlo malo",
      "ingredient_6": "peršun (sveži)",
      "step_1": "U šerpi ili tiganju, na tihoj vatri, propržimo sitno iseckani beli luk.",
      "step_2": "I pržimo sitno ili na komade već iseckanu pršutu.",
      "step_3": "Pržiti zajedno, na tihoj vatri, sve dok luk ne dobije zlatnu tj. žućkastu bojicu.",
      "step_4": "U drugoj posudi skuvati supicu od pečuraka, tako što ćete u vrelu, ključalu vodu (šolju veće vode ili pak 250 ml vode) staviti sadržaj čitave kesice i mešati 2-3 min.",
      "step_5": "Zatim, kada je supica gotova, sjedinite je sa belim lukom i pršutom i mešati 4-5 min. dok vodica ne ispari iz supice, nakon toga u sve to sjediniti kuvanu pavlaku i mešati još dodatnih 5-6 minuta.",
      "step_6": "Raviole spremite na sledeći način. U proključalu vodu, sa malo ulja i malo soli, pustite raviole da se kuvaju 10-ak minuta, a zatim ih izvadite i procedite.",
      "step_7": "Na kraju, servirate jelo, tako što sastavite sos i raviole i preko jela stavite još vrlo malo svežeg peršuna i parmezan sira...njamiiii... Prijatno !",
      "advice": "Testenine nikada nemojte da ispirate hladnom vodom nakon kuvanja, osim ukoliko ih kuvate za salatu koja će se jesti hladna.",
      "posno": false,
      "vegetarijanski": false,
      "ingredients": 6,
      "steps": 7,
      "id": 20
    },
    {
      "recipeCreated": "1.5.2019. 18:44:04",
      "recipeChecked": "2.5.2019. 14:44:04",
      "recipeNumber": 245,
      "views": 4,
      "authorId": 3,
      "category": "Torte",
      "kitchen": "Univerzalna",
      "preparation": "Teško",
      "personNumber": "6 osoba",
      "timePrep": 35,
      "title": "Milka torta",
      "recipeInfo": "Evo jednog slatkog kolačića za sve umerene sladokušce.. Uživajte!",
      "imgUrl": "./img/milka-torta.jpg",
      "qty_1": "300 g",
      "ingredient_1": "mlevena plazma (keks)",
      "qty_2": "1 kom",
      "ingredient_2": "crna čokolada (milka)",
      "qty_3": "200 g",
      "ingredient_3": "šlag",
      "qty_4": "6 kom",
      "ingredient_4": "jaja",
      "qty_5": "600 g",
      "ingredient_5": "plazma u komadu (keks)",
      "qty_6": "1 kom",
      "ingredient_6": "bela čokolada (milka)",
      "qty_7": "250 g",
      "ingredient_7": "margarin",
      "qty_8": "200 g",
      "ingredient_8": "šećer u prahu",
      "step_1": "Umutiti belanca u sneg pa dodati šećer. Nakon toga u to dodati žumanca i 300 grama mlevenog keksa.",
      "step_2": "Podeliti masu u dva dela. U prvi fil dodati rastopljeni margarin sa belom čokoladom. U drugi fil dodati rastopljeni margarin sa crnom čokoladom.",
      "step_3": "Kalup obložiti folijom, redjati plazma keks po dnu i sa strane kalupa pa preliti prvim filom. Nakon toga redjati drugi red plazma keksa pa preliti drugim filom, pa ponovo red keksa odozgo. (keks umakati u mleko pre redjanja).",
      "step_4": "Ostaviti da se torta malo stegne, u frižideru, pre služenja.",
      "advice": "",
      "posno": false,
      "vegetarijanski": true,
      "options": "Vegetarijanski",
      "ingredients": 8,
      "steps": 4,
      "id": 21
    },
    {
      "recipeCreated": "1.5.2019. 18:52:19",
      "recipeChecked": "2.5.2019. 17:52:19",
      "recipeNumber": 242,
      "views": 4,
      "authorId": 3,
      "category": "Hladna predjela",
      "kitchen": "Srpska",
      "preparation": "Srednje",
      "personNumber": "4 osobe",
      "timePrep": 30,
      "title": "Slana tost torta",
      "recipeInfo": "Zašto uvek pravimo slatku tortu -  kad možemo da pravimo i slanu tortu.\n\nSlana tost torta je odlična uvertira ili već uvod u glavno jelo ali je i odličan izbor i za brzinsko hladno predjelo.",
      "imgUrl": "./img/tost_torta.png",
      "qty_1": "18 kriški",
      "ingredient_1": "hleb (ili tost hleb)",
      "qty_2": "4 kom",
      "ingredient_2": "jaja",
      "qty_3": "250 g",
      "ingredient_3": "šunka",
      "qty_4": "100 g",
      "ingredient_4": "sir (feta sir)",
      "qty_5": "150 g",
      "ingredient_5": "kačkavalj",
      "qty_6": "4 kom",
      "ingredient_6": "kiseli krastavčići",
      "qty_7": "180 g / jedna čaša",
      "ingredient_7": "kisela pavlaka",
      "qty_8": "400 g",
      "ingredient_8": "majonez",
      "qty_9": "",
      "ingredient_9": "kečap",
      "qty_10": "",
      "ingredient_10": "kuhinjska so",
      "step_1": "Majonezu i kiselu pavlaku, sjediniti zajedno, promešati a zatim podeliti na 3 dela.",
      "step_2": "U prvi deo dodate iseckane kisele krastavčiće i iseckana kuvana jaja.",
      "step_3": "U drugi deo dodati sitno iseckanu šunku, zgnječeni feta sir i kečapa po ukusu.",
      "step_4": "U treći deo dodati narendani kačkavalj.",
      "step_5": "Redjati 6 parčadi tost hleba pa naneti prvi fil. Redjati 6 parčadi tost hleba pa naneti drugi fil. Na kraju, na preostalih 6 parčadi tost hleba naneti i treći fil. Uživajte ! Odlično je !",
      "advice": "",
      "posno": false,
      "vegetarijanski": false,
      "ingredients": 10,
      "steps": 5,
      "id": 22
    },
    {
      "recipeCreated": "2.5.2019. 19:37:19",
      "recipeChecked": "2.5.2019. 21:37:19",
      "recipeNumber": 353,
      "views": 1,
      "authorId": 5,
      "category": "Salate",
      "kitchen": "Univerzalna",
      "preparation": "Lako",
      "personNumber": "4 osobe",
      "timePrep": 15,
      "title": "Salata sa pomorandžom",
      "recipeInfo": "Stiže proleće, a sa njim i sočna i sveža jela. Čak i ako je kišno i oblačno vreme, duša i telo nam ipak traže prolećni meni. Izbor dobrog voća u ovo doba godine nije baš bogat, ali zato slatke i sočne pomorandže možete lako naći. U ovoj salati, mekoća pomorandže odlično se kombinuje sa nežnim avokadom i pikantnim komoračem.\n\nNa žalost komorač je zaboravljena namirnica i ljudi ga retko koriste u kuhinji. Međutim, ovo povrće je jako zdravo, sadrži dosta kalijuma, kalcijuma, mangana i vitamina C. Pomaže pravilnoj funkciji creva, uklanja otrovne materije iz organizma i smanjuje nivo holesterola i masnoće u krvi. Pored nutritivne vrednosti, zahvaljujući svom osvežavajućem i slatkastom ukusu (koji jako podseća na anis) komorač dodaje zanimljivu nijansu jelima. Možete ga naći na svim pijacama i u većim supermarketima. U svežem obliku dodajem ga u salate i ceđene sokove, a u dinstanom – u čorbe i priloge.",
      "imgUrl": "./img/salata-pomorandza-avokado.jpg",
      "qty_1": "2 kom",
      "ingredient_1": "pomorandže",
      "qty_2": "1 kom",
      "ingredient_2": "avokado",
      "qty_3": "2 kom",
      "ingredient_3": "šargarepa",
      "qty_4": "1 veza",
      "ingredient_4": "peršun",
      "qty_5": "1 kašika",
      "ingredient_5": "maslac (susamovog putera)",
      "qty_6": "2 kašike",
      "ingredient_6": "sok od limuna",
      "qty_7": "1/3 male glavice",
      "ingredient_7": "crveni kupus",
      "qty_8": "1/2 lukovice",
      "ingredient_8": "komorač",
      "qty_9": "",
      "ingredient_9": "kuhinjska so",
      "qty_10": "",
      "ingredient_10": "biber u prahu",
      "step_1": "Naseckajte crveni kupus, šargarepu i komorač na tanke trakice.",
      "step_2": "Oljuštite avokado, izvadite košticu i naseckajte ga na kockice. Očišćenu pomorandžu odvojite na kriške i isecite ih napola.",
      "step_3": "Rukom pocepajte listove salate. Sitno naseckajte peršun.",
      "step_4": "Pomešajte sve i dodajte soli i bibera po ukusu. U odvojenoj činiji spojite sve sastojke za preliv i dodajte ga salati. Preko možete dodati prethodno potopljen badem i svežu rukolu.",
      "advice": "Preliv od maslinovog ulja, limunovog soka i susamovog putera možete koristiti i za druge salate od svežeg povrća. Susamov puter (tan)je obavezan sastojak humusa, koristi se kao namaz za hleb i dodatak za prelive i sosove. Ima ga u svim prodavnicama zdrave hrane.",
      "posno": false,
      "vegetarijanski": true,
      "options": "Vegetarijanski",
      "ingredients": 10,
      "steps": 4,
      "id": 23
    },
    {
      "recipeCreated": "2.5.2019. 19:40:08",
      "recipeChecked": "3.5.2019. 00:40:08",
      "recipeNumber": 700,
      "views": 11,
      "authorId": 5,
      "category": "Hladna predjela",
      "kitchen": "Univerzalna",
      "preparation": "Lako",
      "personNumber": "1 osoba",
      "timePrep": 10,
      "title": "Voćni paketić",
      "recipeInfo": "Volim boje ovog osvežavajućeg voćnog paketića kako sam ga nazvao... Pravi tropski dodir, još ako dodate i malo soka od pomorandže i kašičicu meda kao preliv, oduševićete se..biće to pravo jedno malo voćno remek delo...",
      "imgUrl": "./img/vocni_paketic.jpg",
      "qty_1": "7 - 8 kom",
      "ingredient_1": "maline",
      "qty_2": "1 kom",
      "ingredient_2": "kivi",
      "qty_3": "1 grančica",
      "ingredient_3": "brusnica",
      "qty_4": "1 kriška",
      "ingredient_4": "ananas",
      "qty_5": "",
      "ingredient_5": "borovnice",
      "step_1": "Sve sastojke sjediniti i staviti u jestive korpice i dodati i malo soka od pomorandže i kašičicu meda kao preliv.",
      "step_2": "Dekorišite listićem mente... ...mmmm.. Odlično je! :)",
      "advice": "",
      "posno": true,
      "options": "Posno, Vegetarijanski",
      "vegetarijanski": true,
      "ingredients": 5,
      "steps": 2,
      "id": 24
    }
  ],
  "categories": [{
    "name": [
      "Hladna predjela",
      "Topla predjela",
      "Supe i čorbe",
      "Salate",
      "Pite i testa",
      "Glavna jela",
      "Riba i morski plodovi",
      "Sosovi",
      "Torte",
      "Kolači",
      "Zimnica"
    ],
    "image": [
      "Hladna_predjela.jpg",
      "Topla_predjela.jpg",
      "Supe_i_corbe.jpg",
      "Salate.jpg",
      "Pite_i_testa.jpg",
      "Glavna_jela.jpeg",
      "Riba_i_morski_plodovi.jpg",
      "Sosovi.jpg",
      "Torte.jpeg",
      "Kolaci.jpg",
      "Zimnica.png"
    ]
  }],
  "users": [{
      "name": "Danilo Lukic",
      "email": "lukic3@sbb.rs",
      "password": "danilo31",
      "work": "Elektrotehničar telekomunikacija",
      "city": "Beograd",
      "telephone": "011/2798-515",
      "biography": "",
      "favorites": [
        11,
        1,
        24,
        22,
        14,
        9
      ],
      "id": 1
    },
    {
      "name": "Nikola Muncan",
      "email": "nikola.muncan@gmail.com",
      "password": "djole123",
      "work": "Front End Web Developer",
      "city": "Beograd",
      "telephone": "011/555-333",
      "biography": "",
      "favorites": [],
      "id": 2
    },
    {
      "name": "Teodora Lukic",
      "email": "tea.l94@gmail.com",
      "password": "mina1995",
      "work": "Molekularni Biolog",
      "city": "Beograd",
      "telephone": "011/2772-414",
      "biography": "",
      "favorites": [],
      "id": 3
    },
    {
      "name": "Marko Marković",
      "email": "marko.code@gmail.com",
      "password": "markocode10",
      "work": "Elektrotehničar",
      "city": "Loznica",
      "telephone": "069/194-15-16",
      "biography": "",
      "favorites": [],
      "id": 4
    },
    {
      "name": "Sofija Dabić",
      "email": "milka@sbb.rs",
      "password": "kulinarka10",
      "work": "Ekonomista",
      "city": "Požarevac",
      "telephone": "063/754-369",
      "biography": "",
      "favorites": [],
      "id": 5
    }
  ]
}