{
  "recipes": [{
      "recipeCreated": "24.4.2019. 12:22:44",
      "recipeChecked": "24.4.2019. 18:46:44",
      "recipeNumber": 117,
      "authorId": 1,
      "category": "Glavna jela",
      "kitchen": "Srpska",
      "preparation": "Lako",
      "personNumber": "4 osobe",
      "timePrep": 35,
      "title": "Piletina sa šampinjonima",
      "recipeInfo": "",
      "imgUrl": [
        "img/piletina sa sampinjonima.jpg"
      ],
      "qty_1": "500 g",
      "ingredient_1": "belo meso",
      "qty_2": "500 g",
      "ingredient_2": "šampinjoni",
      "step_1": "Iseckati crni luk zajedno sa belim lukom i šargarepom (na kockice). Propržiti.",
      "step_2": "U drugoj posudi pripremiti belo meso. Odvojiti ga od kostiju i iseći na manje šnicle.",
      "advice": "",
      "posno": false,
      "vegetarijanski": false,
      "id": 1
    },
    {
      "recipeCreated": "27.4.2019. 19:41:32",
      "recipeChecked": "28.4.2019. 00:41:32",
      "recipeNumber": 812,
      "authorId": 1,
      "category": "Hladna predjela",
      "kitchen": "Srpska",
      "preparation": "Srednje",
      "personNumber": "4 osobe",
      "timePrep": 45,
      "title": "Zlatni slani rolat",
      "recipeInfo": "Rolat punjen šunkom i feta sirom..mmmm...\n\nOvaj recept je, bez sumnje, najukusniji slani rolat koji sam ikada napravila. Kada probate ovaj recept, i vi ćete želeti da ga napravite iznova i iznova.\n\nRolat deluje zanimljivo a u isto vreme i prefinjeno, a za decu je, raj za oči i odlična dobitna kombinacija, jer deluje tako razdragano veselo i šaroliko..\n\nNadam se da će te uživati i u pripremi i u ukusu koliko i ja. Odličan je!",
      "imgUrl": [
        "img/slani rolat.jpg"
      ],
      "qty_1": "5 kom",
      "ingredient_1": "jaja",
      "qty_2": "1 kom",
      "ingredient_2": "jogurt",
      "qty_3": "5 sup. kašika",
      "ingredient_3": "brašno",
      "qty_4": "1/2 kesice",
      "ingredient_4": "prašak za pecivo",
      "qty_5": "180 g",
      "ingredient_5": "kisela pavlaka",
      "qty_6": "300 g",
      "ingredient_6": "šunka",
      "qty_7": "300 g",
      "ingredient_7": "sir (feta sir)",
      "qty_8": "1 šoljica",
      "ingredient_8": "ulje",
      "qty_9": "vrlo malo",
      "ingredient_9": "kuhinjska so",
      "step_1": "Kora: Sastaviti sastojke (jaja, jogurt, ulje, brašno, prašak za pecivo) umutiti sa mikserom i dodati malo soli, a onda razliti masu u pleh obložen papirom za pečenje pa ispeći.",
      "step_2": "Ispečenu koru uviti u nakvašenu, čistu kuhinjsku krpu kao rolat i ostaviti da se ohladi.",
      "step_3": "Fil: Sastaviti zajedno i umutiti mikserom ( feta sir, kiselu pavlaku, iseckanu šunku ). Na ispečenu, ohlađenu koru premazati ovaj fil i ponovo uviti u rolat. Uživajte, preukusno je!",
      "advice": "",
      "posno": false,
      "vegetarijanski": false,
      "id": 2
    },
    {
      "recipeCreated": "27.4.2019. 19:50:20",
      "recipeChecked": "27.4.2019. 19:50:20",
      "recipeNumber": 21,
      "authorId": 1,
      "category": "Hladna predjela",
      "kitchen": "Univerzalna",
      "preparation": "Lako",
      "personNumber": "2 osobe",
      "timePrep": 25,
      "title": "Punjeni avokado",
      "recipeInfo": "Avokado je jedan od najhranljivijih plodova u prirodi, bogat kalcijumom,kalijumom, magnezijumom i natrijumom. Sadrži vitamin C, B, E, riboflavin i niacin. Avokado je odličan izvor nezasićenih masnih kiselina, a njegova dijetalna vlakna regulišu probavu.\n\nSirov avokado se najčešće koristi za pripremu različitih namaza i salata. Termički obrađen avokado možete dodavati glavnim jelima ili, kao u ovom receptu, da ga napunite povrćem.\n\nU suštini avokado možete da punite bilo kojom kombinacijom sitno naseckanog svežeg ili kuvanog povrća i začinskog bilja. Pustite maštu na volju !",
      "imgUrl": [
        "img/punjeni avokado.jpg"
      ],
      "qty_1": "2 kom",
      "ingredient_1": "avokado",
      "qty_2": "1 kom",
      "ingredient_2": "paprika",
      "qty_3": "1 kriska",
      "ingredient_3": "sir (koziji)",
      "qty_4": "1 kom",
      "ingredient_4": "paradajz",
      "qty_5": "1 kašika",
      "ingredient_5": "sok od limuna",
      "qty_6": "malo",
      "ingredient_6": "maslinovo ulje",
      "qty_7": "malo",
      "ingredient_7": "kuhinjska so",
      "qty_8": "malo",
      "ingredient_8": "biber u prahu",
      "qty_9": "1",
      "ingredient_9": "mirodjija",
      "step_1": "Plodove avokada operite i isecite uzduž napola. Izvadite košticu. Napravite kockaste zaseke na avokadu.",
      "step_2": "Pomešajte ulje, limunov sok i so i namažite time unutrašnjost plodova. Stavite u rernu zagrejanu do 200 stepeni na 10 minuta.",
      "step_3": "Dok se avokado peče, sitno iseckajte paradajz, papriku i kozji sir. Pomešajte povrće sa naseckanom svežom mirođijom i pobiberite.",
      "step_4": "Kada se avokado ispeče, napunite ga povrćem i ukrasite listićima rukole. Jedite kašićicom zajedno sa „mesom“ avokada. Zbog visoke hranljive vrednosti avokada, ovo jelo je sasvim dovoljno za neku užinu ili čak i večeru.",
      "advice": "",
      "posno": false,
      "vegetarijanski": true,
      "options": "Vegetarijanski",
      "id": 3
    },
    {
      "recipeCreated": "27.4.2019. 20:02:40",
      "recipeChecked": "28.4.2019. 00:02:40",
      "recipeNumber": 644,
      "authorId": 1,
      "category": "Glavna jela",
      "kitchen": "Francuska",
      "preparation": "Lako",
      "personNumber": "2 osobe",
      "timePrep": 25,
      "title": "Piletina sa bešamel sosom",
      "recipeInfo": "Bešamel sos se koristi kao dodatak mnogim jelima ali i kao osnova za neke sosove.\n\nPostoje razne teorije o tome ko je tvorac bešame sosa, ali najčešće se spominju Francuzi. Isključivo su ga koristili plemići, otuda i verovanje da ga je i prvi otkrio, lični kuvar Luja XIV, koji je u to vreme vladao Francuskom. \n\nLuj XIV se toliko oduševio sosom da ga je i nazvao po svom kuvaru Bešamelu i zahtevao je da bešamel sos bude prisutan stalno na njegovom stolu odnosno stalno na njegovoj trpezi.",
      "imgUrl": [
        "img/piletina-sa-besamel-sosom.jpg"
      ],
      "qty_1": "300 g",
      "ingredient_1": "piletina",
      "qty_2": "100 g",
      "ingredient_2": "brašno",
      "qty_3": "50 g",
      "ingredient_3": "margarin",
      "qty_4": "po potrebi",
      "ingredient_4": "mleko",
      "qty_5": "",
      "ingredient_5": "kuhinjska so",
      "qty_6": "",
      "ingredient_6": "biber u prahu",
      "step_1": "Piletinu izlupati sa obe strane (usoliti) i pržiti na laganoj vatri, dok ne porumeni i sa jedne i sa druge strane.",
      "step_2": "U tiganju rastopiti margarin, pa dodavati brašno, ali pomalo i mešati konstantno na tihoj vatri, ( ne dozvoliti da se stvore grudvice) iz tog razloga treba više puta dodavati brašno ali po malo i mleka po potrebi. Kada je sve gotovo sastaviti sa prženom piletinom i servirati.",
      "advice": "Ukoliko vam je meso malo masnije,  čvrsto ga zatvorite u foliju, da bi sačuvali sok.",
      "posno": false,
      "vegetarijanski": false,
      "id": 4
    },
    {
      "recipeCreated": "27.4.2019. 20:18:14",
      "recipeChecked": "28.4.2019. 09:18:14",
      "recipeNumber": 140,
      "authorId": 1,
      "category": "Glavna jela",
      "kitchen": "Srpska",
      "preparation": "Srednje",
      "personNumber": "6 osoba",
      "timePrep": 45,
      "title": "Punjene paprike",
      "recipeInfo": "Punjene paprike pripadaju srpskoj kuhinji ali, ne baš kao nacionalno jelo, zbog raznolikih uticaja koje su Srbi primili kroz burna istorijska događanja, pa se tako punjene papirke prave i jedu i u drugim državama.\n\nSastojci za pripremu nisu skupi a jelo je toliko ukusno i izdašno i možete ga praviti u svim godišnjim dobima, nećete pogrešiti.\n\nJelo sa puno ukusa kao i  povrća i proteina.",
      "imgUrl": [
        "img/punjene_paprike.jpg"
      ],
      "qty_1": "2 glavice",
      "ingredient_1": "crni luk",
      "qty_2": "500 g",
      "ingredient_2": "mleveno meso",
      "qty_3": "1 šolja",
      "ingredient_3": "pirinač",
      "qty_4": "2 kom",
      "ingredient_4": "krompir",
      "qty_5": "2 čena",
      "ingredient_5": "beli luk",
      "qty_6": "12 kom",
      "ingredient_6": "paprike",
      "qty_7": "",
      "ingredient_7": "kuhinjska so",
      "qty_8": "",
      "ingredient_8": "biber u prahu",
      "qty_9": "",
      "ingredient_9": "mešavina začina",
      "qty_10": "",
      "ingredient_10": "crvena paprika u prahu",
      "step_1": "Propržiti na vrelom ulju crni luk, a nakon minut, dva dodati i beli, jer se beli brže prži.",
      "step_2": "Čim luk dobije zlatnu bojicu, dodati i mleveno meso i promešati sve zajedno. Kroz minut, dva dodati čašu vode i mešati sve zajedno još dodatnih 6-7 minuta. Dok mešate, dodajete i začine ( so, biber, mešavinu začina, crvenu tucanu papriku ), pa i 1/3 povrtne kockice ako imate.",
      "step_3": "Nakon toga dodate pirinač u sve to i samo promešate sve zajedno i sklonite sa vatre.",
      "step_4": "Uključite rernu da se zagreje, pa pripremite ( operete, očistite paprike) i punite ih i zatvarate krompirom, brašnom ili paradajzom, a zatim ih ređajte u pleh bez da ste ga prethodno podmazali uljem.",
      "step_5": "Na kraju, saspete u pleh između paprika, svu vodicu koja vam je ostala u šerpi u kojoj je bila smesa za punjenje paprika, ukoliko vam nije ostalo puno, niti malo, onda slobodno u posebnu čašu dodajte ako imate malo paradajz sosa i pomešajte sa vodom i sa malo vegete, pa saspite pored paprika ili prosto dolite jos vrlo malo vode, koja će omogućiti pirinču da se bolje skuva. \n\nStavite i aluminijumsku foliju preko paprika, jer će i ona takođe pomoći pirinču pri kuvanju. Pečete paprike na 250 stepeni 45 min.",
      "advice": "",
      "posno": false,
      "vegetarijanski": false,
      "id": 5
    },
    {
      "recipeCreated": "27.4.2019. 20:29:17",
      "recipeChecked": "28.4.2019. 16:29:17",
      "recipeNumber": 463,
      "authorId": 1,
      "category": "Salate",
      "kitchen": "Ruska",
      "preparation": "Lako",
      "personNumber": "4 osobe",
      "timePrep": 20,
      "title": "Ruska salata",
      "recipeInfo": "Ruska salata je tradicionalna ruska salata, koja se priprema sa majonezom, kuvanim krompirom, šargarepom, kiselim krastavčićima, šunkom, kuvanim jajima, a ponekad i sa različitim vrstama kobasica ili sa kuvanom piletinom.\n\nOva salata je poznata u mnogim evropskim zemljama, ali ne i uvek pod istim imenom. U nekim zemljama (npr. Italija, Francuska, Španija, Makedonija, Bugarska itd.) poznata je kao \"ruska salata\", a u Ukrajini, Nemačkoj, SAD, Velikoj Britaniji  poznata je pod nazivom \"Olivierova salata\" ili \"francuska salata\".\n\n Odličan je pratilac uz meso a kod nas je a verujem i kod mnogih drugih neizostavno jelo ili salata za Novu Godinu i razne proslave; nekada se servira kao salata a nekada samo kao predjelo.\n\nUživajte !",
      "imgUrl": [
        "img/ruska_salata.jpg"
      ],
      "qty_1": "450 g",
      "ingredient_1": "povrće za rusku salatu",
      "qty_2": "250 g",
      "ingredient_2": "stišnjena šunka",
      "qty_3": "3 kom",
      "ingredient_3": "jaja",
      "qty_4": "200 g",
      "ingredient_4": "piletina",
      "qty_5": "4 kom",
      "ingredient_5": "kiseli krastavac",
      "qty_6": "300 g",
      "ingredient_6": "majonez",
      "qty_7": "",
      "ingredient_7": "kuhinjska so",
      "step_1": "Ukuvati povrće u jednoj posudi, drugoj belo meso a u trećoj jaja ( jedno 15-ak minuta ).",
      "step_2": "Kada je sve kuvano, iseckati belo meso, kisele krastavčiće, šunku, i jaja. Sjediniti sve u jednu posudu pa pomešati sa majonezom.",
      "advice": "",
      "posno": false,
      "vegetarijanski": false,
      "id": 6
    },
    {
      "recipeCreated": "27.4.2019. 20:41:38",
      "recipeChecked": "28.4.2019. 16:41:38",
      "recipeNumber": 269,
      "authorId": 2,
      "category": "Salate",
      "kitchen": "Grčka",
      "preparation": "Lako",
      "personNumber": "4 osobe",
      "timePrep": 25,
      "title": "Grčka salata",
      "recipeInfo": "Tradicionalna svima nama dobro poznata, osvežavajuća grčka salata napravljena u kombinaciji paradajza, feta sira, maslina začinjena origanom, prelivena maslinovim uljem. Veoma hranljiva i neodoljivog ukusa.",
      "imgUrl": [
        "img/grcka-salata.jpg"
      ],
      "qty_1": "400 g",
      "ingredient_1": "paradajz",
      "qty_2": "2 glavice",
      "ingredient_2": "crni luk",
      "qty_3": "100 g",
      "ingredient_3": "crne masline",
      "qty_4": "200 g",
      "ingredient_4": "feta sir",
      "qty_5": "1 kom",
      "ingredient_5": "krastavac",
      "qty_6": "",
      "ingredient_6": "ulje",
      "qty_7": "",
      "ingredient_7": "sirće",
      "qty_8": "",
      "ingredient_8": "kuhinjska so",
      "qty_9": "",
      "ingredient_9": "biber u prahu",
      "step_1": "Izabrati krupne, čvrste i zrele paradajze, oprati ih i iseći na kolutove.",
      "step_2": "Crni luk očistiti, oprati, i iseći ga na kolutove, pa odvojiti prstenove. I fetu iseći na kockice.",
      "step_3": "Na veliki tanjir ili plitku činiju ređati paradajz,luk i sir naizmenično. Svaki red soliti, biberiti i prelivati uljem.\nUkrasiti maslinama i služiti odmah.",
      "advice": "",
      "posno": false,
      "vegetarijanski": false,
      "id": 7
    },
    {
      "recipeCreated": "27.4.2019. 20:46:58",
      "recipeChecked": "28.4.2019. 13:46:58",
      "recipeNumber": 753,
      "authorId": 1,
      "category": "Kolači",
      "kitchen": "Italijanska",
      "preparation": "Lako",
      "personNumber": "4 osobe",
      "timePrep": 20,
      "title": "Tiramisu",
      "recipeInfo": "Ovaj kolač, poreklom iz Italije, uvek će vas iznenaditi, kako ukusom, tako i lakoćom pripreme.",
      "imgUrl": [
        "img/tiramisu-kolac-desert.jpg"
      ],
      "qty_1": "2 kutije",
      "ingredient_1": "piškote",
      "qty_2": "4 kom",
      "ingredient_2": "jaja",
      "qty_3": "80 g",
      "ingredient_3": "šećer",
      "qty_4": "250 g",
      "ingredient_4": "kajmak",
      "qty_5": "200 g",
      "ingredient_5": "šlag",
      "qty_6": "1 kom",
      "ingredient_6": "crna čokolada",
      "step_1": "Najpre natopite piškote u kafi.\nZa fil je potrebno pomešati 4 žumanca, šećer i kajmak. Mutite sve dok se masa ne sjedini.",
      "step_2": "Posebno umutiti šlag i sjediniti sa prethodno spremljenom masom.",
      "step_3": "Ređajte piškote, pa preko njih fil i to ponovite dvaput. Zatim narendati odozgo crnu čokoladu. Ohladite i uživajte !",
      "advice": "",
      "posno": false,
      "vegetarijanski": false,
      "id": 8
    },
    {
      "recipeCreated": "27.4.2019. 20:51:30",
      "recipeChecked": "28.4.2019. 06:51:30",
      "recipeNumber": 319,
      "authorId": 1,
      "category": "Kolači",
      "kitchen": "Univerzalna",
      "preparation": "Lako",
      "personNumber": "4 osobe",
      "timePrep": 25,
      "title": "Kocke od kokosa",
      "recipeInfo": "Prefinjena neodoljiva kombinacija kokosa i duboke tamne čokolade, upotpunjena čokoladnom glazurom. Bogato uživanje za sve ljubitelje kokosa i čokolade.",
      "imgUrl": [
        "img/kocke-od-kokosa.jpg"
      ],
      "qty_1": "250 g",
      "ingredient_1": "kokosovo brašno",
      "qty_2": "250 g",
      "ingredient_2": "keks (mleveni)",
      "qty_3": "250 g",
      "ingredient_3": "šećer u prahu",
      "qty_4": "125 g + 50 za preliv",
      "ingredient_4": "margarin",
      "qty_5": "5 štangli",
      "ingredient_5": "crna čokolada",
      "step_1": "Na blagoj temperturi otopiti u vrlo malo vode, šećer i margarin i dodati kokos i keks. Oblikovati na dasci ili u tepsiji kolač četvrtastog oblika.",
      "step_2": "Kada se stegne preliti ga glazurom koja se priprema na sledeći način: na blagoj temperaturi otopiti u posudi margarin i čokoladu, pa vrelo preliti preko kolača.",
      "advice": "Kolač ćete najlakše iseći koncem. Možda ovo niste znali ali pokušajte, jer je zaista efikasno. Prvo oštrim nožem obeležite presek i oko njega stavite jak konac. Krajeve konca prebacite unakrst i lagano zatežete. Tako ćete kolač preseći uvek ravnomerno na pola ili već na više delova.\nZa glazuru, mislim da već znate ; Ukoliko želite da glazura na kolačićima ima i poseban sjaj, dodajte na 100 g čokolade jednu kašičicu masnoće od kokosovog oraha ili pored maslaca dodajte i kašiku ulja.\n\nA pre nego prelijete glazuru na kolač, slobodno prvo premažite kolač tankim slojem marmelade da ne bi testo upilo glazuru.",
      "posno": false,
      "vegetarijanski": false,
      "id": 9
    },
    {
      "recipeCreated": "27.4.2019. 20:57:11",
      "recipeChecked": "28.4.2019. 02:57:11",
      "recipeNumber": 976,
      "authorId": 2,
      "category": "Torte",
      "kitchen": "Univerzalna",
      "preparation": "Lako",
      "personNumber": "2 osobe",
      "timePrep": 25,
      "title": "Plazma torta",
      "recipeInfo": "Nepogrešiv spoj sastojaka sjedinjenih sa plazma keksom  i natopljenim osvežavajućim sokom od narandže, ovaj desert čine neodoljivo laganim, ukusnim, umereno slatkim i sočnim  slatkišem, za sve prilike.\n\nTortica za sve ukuse! Da li zaista postoji neko ko ne voli plazma torticu :) Mislim da se taj još nije rodio :)",
      "imgUrl": [
        "img/plazma torta.jpg"
      ],
      "qty_1": "50-100 g",
      "ingredient_1": "žele kocke",
      "qty_2": "50 g",
      "ingredient_2": "crna čokolada",
      "qty_3": "125 g + 50 g za preliv",
      "ingredient_3": "margarin",
      "qty_4": "300 g",
      "ingredient_4": "plazma keks",
      "qty_5": "100 ml",
      "ingredient_5": "sok od narandže",
      "step_1": "Napravimo prvo, koru od keksa i margarina, tako što pomešamo margarin, keks i žele kocke u jednu činiju u koju polako dolivamo sok od pomorandže. Mešajte rukama dok se svi sastojci dobro ne sjedine i po potrebi dodati još soka. Masa treba da bude gusta ali opet ne i pregusta i nikako ne presuva, da bi mogla da se fino oblikuje. Oblikujete masu u obliku koji želite, ja obično pravim u obliku srca :) i na kuhinjskoj dasci, jer mi je tako najlakše. A onda ostavite u frižider da se malo ohladi, tj.stegne.",
      "step_2": "Za to vreme, u posudu za kuvanje stavimo 50 grama margarina, 2-3 kašike vode, 2 kašike šećera i čokladu. Mešamo na tihoj vatri dok se ne rastopi, pa kad proključa skinuti.",
      "step_3": "Izvadite tortu i prelijete celu površinu čokoladom i stavite odozgo komade preostalih žele kocki.. A onda opet vratimo tortu u frižider da se još malo ohladi i bolje stegne. Brzo i prijatno iznenadjenje sa svakoga!",
      "advice": "Imajte u vidu da je ovo M-I-N-I plazma torta, što možete videti i po k-o-l-i-č-i-n-i sastojaka. Ovo je čisto malo brzinsko iznenađenje za već nekog vama dragog.",
      "posno": false,
      "vegetarijanski": false,
      "id": 10
    },
    {
      "recipeCreated": "27.4.2019. 21:06:26",
      "recipeChecked": "27.4.2019. 21:06:26",
      "recipeNumber": 928,
      "authorId": 1,
      "category": "Kolači",
      "kitchen": "Univerzalna",
      "preparation": "Lako",
      "personNumber": "2 osobe",
      "timePrep": 25,
      "title": "Palačinke od heljde i rogača",
      "recipeInfo": "Jako su interesantne , ako pravite male palačinke. Ja ih poslužujem sa javorovim ili čokoladnim sirupom, domaćim džemom, pastom od lješnjaka (zdravija varijanta eurokrema) i u sezoni - sa bobičastim voćem.\nDodavanjem rogača u palačinke, postićete nezaboravan \"čokoladni\" okus palačinaka i zamamljivu boju.",
      "imgUrl": [
        "img/palacinke od heljde.jpg"
      ],
      "qty_1": "3 kašike",
      "ingredient_1": "brašno",
      "qty_2": "3 kašike ",
      "ingredient_2": "heljdino brašno",
      "qty_3": "malo",
      "ingredient_3": "prašak za pecivo",
      "qty_4": "3 kašike",
      "ingredient_4": "rogač (mleveni)",
      "qty_5": "1 čaša",
      "ingredient_5": "mineralna voda",
      "qty_6": "1 kašika",
      "ingredient_6": "ulje",
      "step_1": "Pomešajte 3 kašike pšeničnog belog brašna, 3 kašike heljdinog brašna i 3 kašike rogača. Dodati na vrh noža prašak za pecivo, kašiku ulja i vode po potrebi. Umutiti smesu mikserom.",
      "step_2": "Peći u tiganju, postepeno smanjujući temperaturu. (Tokom pečenja, vodite računa da postepeno smanjujete temperaturu, kako palačinke ne bi izgorele). Pecite palačinke na minimalnog količini ulja.",
      "step_3": "Za posluživanje, premazati javorovim sirupom ili domaćim džemom.",
      "advice": "Za pravljenje palačinaka bez jaja, potrebno je strpljenje! Možda palačinke neće uspjeti prvi puta, ali nemojte da vas to pokoleba.",
      "posno": false,
      "vegetarijanski": true,
      "options": "Vegetarijanski",
      "id": 11
    },
    {
      "recipeCreated": "27.4.2019. 21:16:34",
      "recipeChecked": "28.4.2019. 18:16:34",
      "recipeNumber": 772,
      "authorId": 2,
      "category": "Supe i čorbe",
      "kitchen": "Univerzalna",
      "preparation": "Lako",
      "personNumber": "4 osobe",
      "timePrep": 25,
      "title": "Potaž od krompira i pečene cvekle",
      "recipeInfo": "Ova slatkasto-ljuta krem čorba obogaćena ukusom kokosa i pikantnih začina postala je jedna od mojih omiljenih varijanti za ručak. Cvekla i krompir su dostupni tokom cele godine i dobro zasite. Kokosovo mleko i začini mogu da se nađu u prodavnicama zdrave hrane, a često i u velikim supermarketima.\n\nJoš jedna prednost ove čorbice je njena vedra pink boja koja će razvedriti najsivlje dane. ",
      "imgUrl": [
        "img/potaz_od_krompira.jpg"
      ],
      "qty_1": "6 kom (600 g)",
      "ingredient_1": "krompir",
      "qty_2": "2-3 (400-500 g)",
      "ingredient_2": "cvekla",
      "qty_3": "200-300 ml",
      "ingredient_3": "mleko",
      "qty_4": "1 kom",
      "ingredient_4": "limun",
      "qty_5": "2-3 čena",
      "ingredient_5": "beli luk",
      "qty_6": "",
      "ingredient_6": "kuhinjska so",
      "qty_7": "",
      "ingredient_7": "biber u prahu",
      "qty_8": "",
      "ingredient_8": "kumin",
      "qty_9": "1 čašica",
      "ingredient_9": "Čili - krupna paprika",
      "step_1": "Zagrejte rernu do 200°C. Operite cveklu i stavite da se peče u plehu, sve sa korom. Ako je cvekla velika, isecite je na pola. Pecite u rerni oko sat vremena.",
      "step_2": "Dok se cvekla peče, oljuštite krompir, naseckajte ga na komadiće i kuvajte dok ne omekša (oko pola sata). Posolite vodu kada provri. Kada se krompir skuva, nemojte prosuti vodu u kojoj se kuvao, trebaće kasnije za čorbu.",
      "step_3": "Gotovu cveklu izvadite iz rerne i ohladite. Oljuštite je rukama, naseckajte i izmiksajte u blenderu ili štapnim mikserom. Dodajte krompir, začine, sok limuna, beli luk, kokosovo mleko, so i biber. Izmiksajte sve zajedno dok ne postane homogena masa. Dodajte par šolja vode u kojoj se kuvao krompir kako biste dobili željenu gustinu čorbe.",
      "step_4": "Zagrejte potaž ukoliko je potrebno. Kada služite, možete da ukrasite čorbu svežim začinskim biljem, semenkama, mrvljenim lešnikom ili pahuljicama čili papričice.",
      "advice": "Nikad nisam bila ljubitelj cvekle, ali u ovom receptu cvekla se jedva oseća i oduševiće svojim ukusom čak i one koji ne vole ovo povrće.",
      "posno": false,
      "vegetarijanski": false,
      "id": 12
    }
  ],
  "users": [{
      "name": "Danilo L.",
      "email": "lukic3@sbb.rs",
      "password": "danilo31",
      "work": "Elektrotehničar telekomunikacija",
      "city": "Beograd",
      "telephone": "011/2798-515",
      "biography": "",
      "favorites": [
        1
      ],
      "id": 1
    },
    {
      "name": "Nikola",
      "email": "nikola.muncan@gmail.com",
      "password": "djole123",
      "work": "",
      "city": "Beograd",
      "telephone": "011/555-333",
      "biography": "",
      "favorites": [],
      "id": 2
    }
  ]
}